import 'package:flutter/material.dart';
import 'package:flutter/src/widgets/container.dart';
import 'package:flutter/src/widgets/framework.dart';

class jaipur extends StatefulWidget {
  const jaipur({super.key});

  @override
  State<jaipur> createState() => _jaipurState();
}

class _jaipurState extends State<jaipur> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: ListView(children: [
      Center(
        child: Material(
          child: Container(
            decoration: BoxDecoration(
                borderRadius: BorderRadius.circular(10),
                color: Color.fromARGB(255, 255, 252, 252)),
            padding: EdgeInsets.all(15),
            width: MediaQuery.of(context).size.width * 8,
            // height: 900,
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                ClipRRect(
                  borderRadius: BorderRadius.circular(5),
                  child: Image.asset(
                    "Assets/image/23.jpg",
                    fit: BoxFit.fill,
                    height: 170,
                    width: double.maxFinite,
                  ),
                ),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "City Palace Jaipur\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  " सिटी पैलेस जयपुर, राजस्थान के सबसे प्रसिद्ध ऐतिहासिक तथा पर्यटन स्थलों में से एक है। यह एक महल परिसर है। सिटी पैलेस एक लोकप्रिय विरासत है जो शहर के बीचोबीच स्थित है। इस शानदार महल का निर्माण महाराजा सवाई जय सिंह माधो ने करवाया था जिन्‍होने जयपुर की स्‍थापना की थी। इस खूबसूरत परिसर में कई इमारतें, विशाल आंगन और आकर्षक बाग़ हैं, जो इसके राजसी इतिहास की निशानी हैं। इस परिसर में ‘चंद्र महल’ और ‘मुबारक महल’ जैसे महत्वपूर्ण भवन भी हैं। इस महल के छोटे से भाग को संग्रहालय और आर्ट गैलेरी में तब्दील किया गया है। महल की खूबसूरती को देखने के लिए सैलानी दुनिया भर से हज़ारों की संख्या में सिटी पैलेस में आते हैं। राजस्थान में दो सिटी पैलेस है एक जयपुर में स्थित है तो दूसरा उदयपुर में स्थित है। उदयपुर का सिटी पैलेस जयपुर में स्थित सिटी पैलेस से काफी भिन्न है, यह महल जयपुर में स्थित महल से काफी समय पहले बनाया गया था। आज के इस लेख में हम जयपुर के सिटी पैलेस की बात करेंगे।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/24.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Amer Kiley\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "आमेर का किला भारत में राजस्थान राज्य की राजधानी जयपुर में स्थित है। जयपुर को गुलाबी शहर के नाम से भी जाना जाता है। आमेर का किला भारत के सबसे बड़े किलो में से जाना जाता है और यह किला अरावली पर्वत की चोटी पर स्थित है। आमेर का किला अपनी वास्तुशिल्प कला और पौराणिक इतिहास की वजह से पूरे विश्व में प्रसिद्ध हैं और इस किले में प्रतिदिन हजारों की संख्या में पर्यटक घूमने आते हैं। आमेर के किले में की गई कारीगरी और बेजोड़ नक्काशी यहां पर आने वाले पर्यटकों को अपनी और आकर्षित करती है और पर्यटक फोटोग्राफी और वीडियोग्राफी का भरपूर आनंद उठाते हैं। दोस्तों आप भी कभी राजस्थान के गुलाबी शहर जयपुर की यात्रा पर जाते हो तो आमेर किले को देखना ना भूलें। आमेर किले का इतिहास बहुत ही रोचक है। आमेर के इस किले के निर्माण के बारे में भी अलग-अलग कहानियां हैं। कहा जाता है सबसे पहले आमिर किले का निर्माण 967 ईस्वी में मीणा जनजाति द्वारा करवाया गया था। कहा जाता है इस किले का नाम भगवान शिवजी के अंबिकेश्वर नाम से रखा गया है। लेकिन यहां के स्थानीय लोगों का यह भी कहना है कि इस किले का नाम देवी दुर्गा के नाम अंबा से रखा गया है। कहा जाता है 11 वीं शताब्दी के दौरान आमेर पर कछवाहों का शासन रहा था। फिर 16 वी शताब्दी में राजा मान सिंह प्रथम ने पुराने अवशेषों पर दुबारा आमेर के किले का निर्माण करवाया इसके बाद वहां के राजा के जो उत्तराधिकारी थे वो इसमें संशोधन और नवीकरण का काम करवाते रहे और सन 1727 में सवाई जय सिंह दृतीय ने अपनी राजधानी आमेर से जयपुर बना ली थी |Amer fort आमेर का यह किला पुराने जमाने में बनी वास्तुशैली एवं इतिहास का एक बेजोड़ नमूना है। इस किले में कई ऐसी जगहें हैं जो देखने लायक है। इस किले में सूर्य द्धार, चन्द्रपोल द्धार, जलेब चौक, सैलानी महल, सिंहपोल द्धवार, दीवान-ए-आम, गणेश द्धवार, शिला देवी मंदिर, सुख महल और शीश महल की सुंदरता और भव्यता देखने की मिलती है। \n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/25.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Jaigarh Kiley\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontSize: 20,
                      fontWeight: FontWeight.bold),
                ),
                Text(
                  " जयगढ़ किला राजस्थान के प्रमुख पर्यटन स्थल में से एक है और भारत के इतिहासिक स्मारकों में शामिल है। जयगढ़ किले का निर्माण जयपुर शहर को सुरक्षित करने के लिए किया गया था। मूल रूप से आमेर किले की रक्षा के लिए बनाया गया है, जयगढ़ किले की वास्तुकला आमेर किले के समान है। किले को दिया जाने वाला दूसरा नाम विजय किला है। किला का निर्माण सावन जय सिंह द्वितीय द्वारा 15वीं से 18वीं शताब्दी के बीच लाल रेत के पत्थरों का उपयोग कर बनाया गया था। यह भारत के गुलाबी शहर जयपुर से 15 किमी की दूरी पर स्थित है। यह किला राजा और शाही परिवार के लिए एक आवासीय स्थान के रूप में बनाया गया था। बाद में किले का इस्तेमाल हथियारों को रखने के लिए किया जाता था। इस भव्य किले में विशाल हथियार, तोपों और अन्य हथियारों को संगठित करने के लिए कई परिसर हैं, जैसे योद्धाओं की सभा के स्थानों के साथ। जयगढ़ किले का निर्माण सनसनीखेज है और यह 3 किमी के क्षेत्र में फैल गया है। जयपुर में अरवलीहिस के ‘चील का टीला’ (ईगल हील) पर स्थित है। किले को युद्ध में कभी जीता नहीं गया था, और जयपुर के तीनों किलों में से सबसे मजबूत किला भी था। मुगल राजवंश के दौरान, यह किला गवाह है औरंगजेब की हार का जिसने अपने भाइयों को मार डाला था। इस किले में केवल एक बार दुनिया की सबसे बड़ी तोप का परीक्षण किया था। लोककथाओं के अनुसार, शासकों ने किले की मिट्टी में एक विशाल खजाना दफनाया था, हालांकि, यह खजाना कभी मिला नहीं। यह माना जाता है कि 1970 के दशक में जब राजस्थान की सरकार ने खजाना खोजा था, उसे जब्त कर लिया गया था। इस किले का मुख्य द्वार डुंगर दरवाजा है, स्क्रीनिंग विंडो के साथ कई विशाल कमरे और हॉल हैं। इस किले को दुनिया के सबसे बड़े तोप के नाम के साथ जोड़ता हैं, जिसे जैवन कहा जाता है, जिसे पहियों पर रखा गया है। इस कैनन का वजन लगभग 50 टन और बैरल 20.19 फुट लम्बा और 11 इंच के व्यास वाले यह कैनन इस किले का मुख्य आकर्षण है। लक्ष्मी विलास, विलास मंदिर, ललित मंदिर और अराम मंदिर, इसके प्रमुख आकर्षण हैं। 10वीं सदी में बनाया गया राम हरिहर मंदिर, और 12 वीं शताब्दी में निर्मित काल भैराव मंदिर इस किले के दो पुराने मंदिर हैं। किले के परिसर के भीतर एक फारसी शैली उद्यान भी है, जिसे 4 भागों में विभाजित किया गया है। अराम मंदिर में प्रवेश ‘आनी दरवाजा’ के माध्यम से होता है जो एक शानदार त्रिकोणीय धनुषाकार प्रवेश द्वार है। संग्रहालय अवामी गेट की बाईं ओर स्थित है जो कठपुतलियों, कलाकृतियों, तस्वीरों और किले के अंदर राजपूत शासकों के युद्ध उपयोगिता को प्रदर्शित करता है। जयगढ़ किला जयपुर के सबसे मजबूत किले में से एक है और पूरे शहर का एक विशाल दृश्य प्रदान करता है। यह किला सप्ताह के सभी दिनों 9.00 से 4.30 तक खुलता है। यह विद्याधर नामक एक वास्तुकार द्वारा डिजाइन किया गया था। किले का दौरा करने का सबसे अच्छा समय अक्टूबर और मार्च के बीच है\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/26.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 9,
                ),
                Image.asset("Assets/image/27.jpg"),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Nahargarh Kiley\n",
                  style: TextStyle(
                      fontSize: 20,
                      fontWeight: FontWeight.bold,
                      color: Color.fromRGBO(0, 0, 0, 1)),
                ),
                Text(
                  "राजस्थान के पिंक सिटी में आरावली पर्वत की ऊंचाई पर बना हुआ है। किले से शहर नज़ारा सच में एक बहुत सुन्दर दृश्य पेश करता है, नाहरगढ़ का अर्थ है “बाघों का निवास”। आमेर किला और जयगढ़ किले के साथ नाहरगढ़ किला भी जयपुर  शहर को एक कड़ी सुरक्षा प्रधान करता है। असल में किले का नाम पहले सुदर्शन गढ़ था लेकिन बाद में इसको नाहरगढ़ किले के नाम से जाना जाने  लगा। परसिद्ध प्रथाओं  के अनुसार नाहार  नाम का नाहार  शेर बोमिया के लिए गया था। जिन्होंने किले के लिए जगह उपलब्ध करवाई और निर्माण करवाया  नाहार की याद में किले के अंदर एक मंदिर का निर्माण भी किया गया है। जो उन्ही के नाम  से जाना जाता है।  वर्ष 1734 में महाराजा सवाई जय सिंह द्वारा जयपुर में ेस्थापित किया गया था। इस किले के चारो और सुरक्षा के लिए दीवारें  बनवाई गयी है, कहा जाता है। की  यह किला  पहले आमेर की राजधानी हुआ करता था। दिलचस्प बात यह है कि पूरे इतिहास के दौरान किले पर कभी हमला नहीं किया गया। फिर भी यहां पे कही ऐतिहासिक घटनाय हुई है। जिस में मुख्य रूप से 18 शताब्दि में जयपुर के मराठाओं के साथ लड़ाई भी शामिल है 1837 के बाद विद्रोह  के समय इस क्षेत्र में  यूरोपियन  जिसमे ब्रिटिशों पत्नियां भी शामिल थी। सभी को Jaipur के राजा सवाई राम सिंह ने उनकी सुरक्षा के लिए नाहरगढ़ किले में भेज दिया था 1868 में महाराजा राम सिंह के शासन कल में इस किले का विस्तार किया गया था। सवाई माधव सिंह द्वारा बनवाया गया  माधवेंद्र  भवन Jaipur की  रानियों को बहुत शूट करता था Nahargarh fort  700 ft की ऊंचाई पर शहर की सुरक्षा को देख कर बनवाया गया था। और मुगलो द्वारा इस किले पे कभी कोई आक्रमण नहीं किया गया था। नाहरगढ़ किले में लगी पिस्तौल का उपयोग फायरिंग का संकेत के लिए किया जाता है। 1857 में भारत विद्रोह के समय बहुत से यूरोपियन लोगो के राज्ये सवाई राम सिंह ने उसकी सुरक्षा  लिए नाहरगढ़ किले में भेजा था। बॉलीवुड की कहि प्रसिद्ध फिल्मो  की शूटिंग इसी किले में की गयी थी जैसे रंग दे बसंती, जोधा अकबर, नाहरगढ़ किले का सबसे मनमोहक भाग माधवेंद्र भवन है। जो रॉयल महिलाओ के लिए बनवाया गया था। और महल के कमरों को भी गलियारे से जोड़ा गया है नासिये बोमिया के नाम पे ही इस किले का नाम रखा गया है। लेकिन आखिर यह इंसान है कौन जिसके नाम पे इस किले का नाम रखा गया है कुछ लोगो का मानना है की वह एक राठौर प्रिंस था। और जिस जगह पर राजा सवाई जय सिंह ने यह किला बनाया गया था। वह नासिये बोमिया की ही थी। जय सिंह ने उसकी आत्मा की शांति के लिए किले के अंदर उनके नाम  एक मंदिर भी बनवाया था तभी से उन्होंने किले का नाम उन्ही पर रख दिया था।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/28.jpg"),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Jal Mahal \n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "जल महल या वाटर पैलेस जयपुर में देखने के लिए सबसे राजसी स्थानों में से एक है। शहर अद्भुत स्थापत्य सुंदरियों से युक्त है और जल महल कला के इन कार्यों में सबसे आगे है। मान सागर झील के बीच में खड़ा महल, जब आप पहली बार इसे देखेंगे, तो आपको झील के ऊपर लगभग तैरने का भ्रम होगा और यही वह क्षण है जब यह दृश्य आपकी सांसें रोक लेता है। Jal Mahal Information in hindi महल बहुत ऊँचा नहीं है और इसके चारों कोनों पर गुम्बद के आकार के चार स्तंभ हैं और बीच में एक बड़ा है। जल महल कभी जयपुर के महाराजा के लिए शूटिंग लॉजिंग था और अब जयपुर के स्थलों में से एक है। यद्यपि जयपुर शहर ने अपने अधिकांश भवनों में गुलाबी पत्थर का उपयोग किए जाने के कारण खुद को गुलाबी शहर का उपनाम अर्जित किया है, जल महल इसके निर्माण में प्रयुक्त लाल बलुआ पत्थर के कारण अद्वितीय है। आज, आगंतुक महल को एक पर्यटक आकर्षण के रूप में नहीं देख सकते हैं क्योंकि इस स्थान को एक रेस्तरां में बदल दिया गया है और आगंतुकों का प्रवेश रोक दिया गया है। जल महल का शाब्दिक अर्थ है “जल महल”, लेकिन जब इसे बनाया गया था, महाराजा माधो सिंह प्रथम ने इसे महल के रूप में उपयोग करने का इरादा नहीं किया था। इसके बजाय, यह राजा और उनके दल के लिए उनकी बतख शिकार यात्राओं के दौरान एक शिकार लॉज माना जाता था। महल जयपुर शहर में मान सागर झील के बीच में स्थित है, और दर्शनीय स्थलों की यात्रा के लिए आज तक एक प्रसिद्ध स्थान है। जल महल को एक क्लासिक राजपूत तरीके से डिजाइन किया गया है, जिसमें गुलाबी बलुआ पत्थर एक सममित शैली में है। मान सागर झील के किनारे से बहुत सारे लोग जल महल देखने आते हैं, लेकिन बहुत से लोग इस प्राचीन महल के निर्माण में इस्तेमाल की गई तकनीक और नवीन डिजाइन के बारे में नहीं जानते हैं। सतह पर, महल की एक मंजिल प्रतीत होती है, लेकिन वास्तव में, महल में चार और जलमग्न स्तर हैं क्योंकि इसकी पत्थर की दीवारें लाखों लीटर पानी को रोक कर रखती हैं, और विशेष रूप से डिज़ाइन किया गया चूना मोर्टार महल में पानी के रिसने को रोकता है, कुछ जो यह 250 से अधिक वर्षों से कर रहा है। अभी के लिए, महल अधिकांश जनता के लिए खुला नहीं है, इसलिए पर्यटक इस शानदार संरचना को देखने के लिए झील के किनारे आते हैं। शाम के समय, बैंक स्ट्रीट फूड विक्रेताओं से भी भरे होते हैं, और यह जगह काफी भीड़भाड़ वाली हो जाती है क्योंकि लोग शहर की हलचल में संभवतः सबसे शांत स्थान पर जाते हैं। बलुआ पत्थर की दीवारों का हल्का रंग झील के गहरे नीले रंग के साथ एक तीव्र विपरीतता पैदा करता है, और महल के भीतरी आंगनों से कुछ हरे पत्ते भी उगते हुए देख सकते हैं, जो इसे जयपुर में सबसे अधिक फोटो खिंचवाने वाले स्थानों में से एक बनाता है।\n",
                  style: TextStyle(fontSize: 20),
                ),
              ],
            ),
          ),
        ),
      ),
    ]));
  }
}
