import 'package:flutter/material.dart';

class Alwar extends StatefulWidget {
  const Alwar({super.key});

  @override
  State<Alwar> createState() => _jaisalmerState();
}

class _jaisalmerState extends State<Alwar> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: ListView(children: [
      Center(
        child: Material(
          child: Container(
            decoration: BoxDecoration(
                borderRadius: BorderRadius.circular(10),
                color: Color.fromARGB(255, 255, 252, 252)),
            padding: EdgeInsets.all(15),
            width: MediaQuery.of(context).size.width * 8,
            // height: 900,
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                ClipRRect(
                  borderRadius: BorderRadius.circular(5),
                  child: Image.asset(
                    "Assets/image/62.jpg",
                    fit: BoxFit.fill,
                    height: 170,
                    width: double.maxFinite,
                  ),
                ),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Phatehaganj ka makabara \n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "फतेह जंग के मकबरे को फतेह जंग की गुंबज के नाम से भी जाना जाता है, जो अलवर में स्थित एक मुख्य पर्यटक आकर्षण है। यह स्मारक फतेह जंग, मुगल सम्राट शाहजहां के एक मंत्री को समर्पित है। इस भवन में पांच मंजिलें है और और इसका डिजाइन मुगल और राजपूत स्थापत्य शैली के एक मिश्रण को दर्शाता है। यात्री एक बड़ी संख्या में सुंदर उद्यानों से घिरे हुए, कलात्मक आकृति वाले इस मकबरे को देखने के लिए आते हैं।  \n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/63.webp",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/64.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Pandupol Hanuman Temple\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "पांडुपोल का हनुमान मंदिर राजस्थान के सरिस्का राष्ट्रीय बाघ अभयारण्य के अंदर स्थित एक प्रसिद्ध मंदिर है। जिसमे भगवान हनुमान की एक विशाल मूर्ति वैराग्य स्थिति में स्थापित है। अरावली रेंज के ऊंचे कगार वाले पहाड़ी के बीच,स्थित पांडुपोल का प्राचीन हनुमान मंदिर अलवर में सबसे अधिक देखी जाने वाली जगहों में से एक है। मंदिर के परिसर लंगूर, मकाक और कई प्रकार के पक्षियों और अपने भव्य 35-फुट झरने के लिए भी प्रसिद्ध है। पांडुपोल का संबंध महाभारत के महाकाव्य की अवधि से माना जाता है। माना जाता है कि पांडवों ने निर्वासन के दौरान अपने जीवन कुछ साल पांडुपोल में बिताए थे। एक अन्य कथा के अनुसार, यह पांडुपोल वही स्थान था जहा भगवान हनुमान ने भीम को पराजित कर उसके अभिमान पर अंकुश लगाया। पांडुपोल हनुमान मंदिर इतिहास  5000 साल पुराना माना जाता है पौराणिक कथा के अनुसार भीम ने अपनी गदा से प्रहार किया जिससे पहाड़ मे दरवाजा निकल गया और पहाड़ पर बना दरवाजा ही पांडुपोल हनुमान मंदिर के नाम से स्थापित हो गया। एक अन्य कथा के अनुसार,  पांडुपोल वही स्थान था जहा भगवान हनुमान ने भीम को पराजित कर उसके अभिमान पर अंकुश लगाया था। आपको बता दे की पांडुपोल वही रहस्यमयी स्थान जहा पांडवों ने अपने निर्वासन के दौरान अपने कुछ साल पांडुपोल में बिताए थे। जबकि एक अन्य कथा के अनुसार, यह पांडुपोल वही स्थान था जहा भगवान हनुमान ने भीम को पराजित कर उसके अभिमान पर अंकुश लगाया। पांडुपोल हनुमान मंदिर का मेला अलवर का एक लोकप्रिय मेला है जो हर साल भादौ शुक्ल पक्ष की अष्टमी को भरता है। जहा बड़ी संख्या में दिल्ली, पंजाब, मध्यप्रदेश व अन्य जगहों से श्रद्धालु आते है। अगर आप पांडुपोल हनुमान मंदिर जाने का प्लान बना रहे है तो आपको बता दे की आप पांडुपोल हनुमान मंदिर घूमने जाने के लिए अक्टूबर से मार्च का समय सबसे बेहतर समय माना जाता है। पांडुपोल हनुमान मंदिर जाने के लिए सर्दियाँ का समय आदर्श समय होता है क्योंकि इस दौरान मौसम बहुत सुहावना होता है। \n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/65.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/66.png",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Neelkanth Mahadev Temple\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontSize: 20,
                      fontWeight: FontWeight.bold),
                ),
                Text(
                  "मन्दिर में विराजमान शिवलिंग पूर्ण रूप से नीलम पत्थर से निर्मित है जिनकी ऊॅचाई सांढे चार फीट है, मन्दिर गर्भगृह सहित नीलकण्ठ महादेव मन्दिर गुंबद पूर्ण रूप से पत्थरो से बना हुआ है जिसमें चुना का उपयोग कही भी नहीं किया गया है, मन्दिर के गर्भग्रह एवं गुम्बदो पर दुलर्भ देवी देवताओ की मूर्तियॉ उकेरी गई थी जो इस मन्दिर में ही र्दुलभ प्रतिमाऐं देखने को मिलती है, मन्दिर में नृत्य अवस्था में प्रथम पूजय देव गणेश जी की नृत्य अवस्था में प्रतिमा है जो राजस्थान में किसी भी मन्दिर में देखने को नही मिलती है, यहॉ मन्दिर में ऐसी कई दुर्लभ देवी देवताओ की प्रतिमाऐ है जो प्राचीन संस्कृति की मूर्ति कलाकृतियों एवं पाषाणो से मन्दिर बना हुआ है । नीलकण्ठ महादेव मन्दिर की पूजा अर्चना योगी /नाथ सम्प्रदाय द्वारा की जाती है, यहॉ नाथ सम्प्रदाय के परिवारो द्वारा पूजा अर्चना की जाती है, गुलजारी लाल योगी एवं सत्यनारायण योगी ने बताया नीलकण्ठ महादेव मन्दिर की स्थापना पाण्डवो द्वारा की गई थी, तभी से मन्दिर के गर्भग्रह में अखण्ड ज्योत जलती आ रही है, महाशिवरात्रि पर मेला भरता है मेले में आने वाले भक्तो के लिये प्रसाद की व्यवस्था एवं पूजा अर्चना की व्यवस्था की जाती है गाजर का हलवा का प्रसाद वितरण किया जाता है, य? शिवरात्रि ??ि पर राजस्थान के प्रत्येक जिले से एवं दिल्ली, हरियाणा, पंजाब, गुडगावं, मुंबई, हरियाणा सहित भारत देश के कोने से श्रद्वालु आकर भोलेनाथ की पूजा अर्चना कर मनवांछित फल प्राप्त करते है वैसे यहॉ श्रावण एवं भाद्व मास में भी माह मैला भरता है जिसमें भी प्रत्येक दिन बड़ी संख्या में भक्तजन आकर भोले का अभिषेक करते है। * श्रद्वालुओ का मानना है कि महाशिवरात्रि एवं श्रावण एवं भाद्वा मास में मन्दिर में विराजमान नीलकण्ठ महादेव शिवलिंग का प्राकृतिक रूप दिन में तीन प्रकार के रगं में दिखाई देते है जो भक्तो की श्रद्वा के अनुसार होता है, कुछ इतिहास कार नीलकण्ठ महादेव मन्दिर की स्थापना सन् 1010 में राजा अजयपाल द्वारा करवाना भी बताते है वैसे जन साधारण इसे पाण्डवो द्वारा निर्मित ही बताते है । * किवदंति है कि प्राचीन समय में यह पारानगर शहर था पारानगर को देखते हुए यहॉ जैनो के तीर्थकर का एक मन्दिर वर्तमान समय में मौजूद है व भगवान महावीर बुद्व की 27 फीट की प्रतिमा आज भी देखने को मिलती है, पारानगर के अवशेष आज भी मौजूद है यहॉ प्राचीन समय में मूर्ति कलाकृतियॉ के पाषाणों से निर्मित पारानगर के खण्डहरो के अवशेष आज भी देखने को मिलते है नीलकण्ठ महादेव मन्दिर की सुरक्षा के लिये यहॉ पुरातत्व विभाग के कर्मचारी एवं पुलिस जाप्ता 24 घण्टे तैनात रहता है । * नीलकण्ठ महादेव मन्दिर के पास उद्यान का निर्माण व भक्तो के आने जाने के लिये डामरीकृत सडक़ निमार्ण हो जावे तो यहॉ पर्यटन स्थल के साथ ही श्रद्वालुओ के अलावा पयर्टन की संख्या में इजाफा होगा जिससे यहॉ के निवासीयो को रोजगार के साथ साथ सरिस्का में आने वाले पयर्टको को भी इस स्थल को देखने का मौका मिलेगा । इसके वि \n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/67.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/68.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                SizedBox(
                  height: 10,
                ),
                Text(
                  " Bala Fort, \n",
                  style: TextStyle(
                      fontSize: 20,
                      fontWeight: FontWeight.bold,
                      color: Color.fromRGBO(0, 0, 0, 1)),
                ),
                Text(
                  "भारत में ऐसे कई प्राचीन किले हैं, जो अपने आप में बेहद ही खास और रहस्यों से भरे हुए हैं। एक ऐसा ही किला अरावली की पहाड़ियों पर स्थित है। इस किले की दीवार पूरी पहाड़ी पर फैली हुई है जो हरे-भरे मैदानों से होकर गुजरती है। यह किला देखने में इतना खूबसूरत लगता है कि इसे देखने के लिए दूर-दूर से बड़ी संख्या में लोग आते हैं। एक समय था जब किले के अंदर प्रवेश करने के लिए इलाके के एसपी से अनुमति लेनी पड़ती थी, लेकिन अब ऐसा नहीं है। बस पर्यटकों को केवल संतरी के पास रखे रजिस्टर में अपना नाम लिखना होता है। उसके बाद वो इस भव्य किले में प्रवेश कर सकते हैं। इस किले को 'बाला किला' के नाम से जाना जाता है, जो राजस्थान के अलवर में है। इस वजह से इसे 'अलवर फोर्ट' भी कहा जाता है। पूरे अलवर में अगर देखें तो यह किला वहां की सबसे पुरानी इमारत है। माना जाता है कि इस किले का निर्माण कार्य 1492 ईस्वी में हसन खान मेवाती ने शुरू करवाया था। यह अपने भव्य संरचनात्मक डिजाइन के लिए पूरे देश में प्रसिद्ध है।  इस किले पर मुगलों से लेकर मराठों और जाटों तक का शासन रहा है। किले की दीवारों में 446 छेद हैं, जिन्हें खास तौर पर दुश्मनों पर गोलियां बरसाने के लिए बनवाया गया था। इन छेदों 10 फुट की बंदूक से भी गोली चलाई जा सकती थी। इसके अलावा दुश्मनों पर नजर रखने के लिए किले में 15 बड़े और 51 छोटे बुर्ज बनवाए गए हैं। इसकी सबसे खास बात ये है कि इतिहास में इस किले पर कभी युद्ध नहीं हुआ। इस वजह से इसे 'कुंवारा किला' भी कहा जाता है। यह किला पांच किलोमीटर लंबा और करीब 1.5 किलोमीटर चौड़ा है। किले के अंदर प्रवेश के लिए कुल छह दरवाजे बनवाए गए हैं, जिनके नाम जय पोल, सूरज पोल, लक्ष्मण पोल, चांद पोल, कृष्णा पोल और अंधेरी पोल हैं। कहते हैं कि इस किले में मुगल शासक बाबर और जहांगीर भी रुक चुके हैं। बाबर ने यहां महज एक ही रात बिताई थी। वहीं जहांगीर किले के अंदर बने जिस कमरे में ठहरे थे, उसे आज 'सलीम महल' के नाम से जाना जाता है। कहते हैं कि इस किले के अंदर बेशकीमती खजाना छुपा हुआ है। माना जाता है कि वो खजाना धन के देवता कुबेर का है, लेकिन ये खजाना एक रहस्य ही है, क्योंकि आज तक कोई भी ढूंढ नहीं पाया है।  \n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/69.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/70.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Vijay Mandir Palace \n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  " 1918 ईस्वी में महाराजा जय सिंह प्रभाकर द्वारा निर्मित, विजय मंदिर पैलेस अलवर शहर से लगभग 10 किमी दूर स्थित एक सुंदर महल है। अग्रभूमि में शांत झील और महल के चारों ओर शानदार उद्यान इस जगह को और अधिक सुंदर बनाता है। इस विशाल स्थान में 105 कमरे हैं। ऐसा कहा जाता है कि पहले राजा ने महल का निर्माण करने का आदेश दिया था, लेकिन वह उस महल से खुश नहीं थे और फिर उन्होंने विजय मंदिर का निर्माण करने का आदेश दिया। महल में एक विशाल बगीचा भी है, जो सुंदर फूलों और पेड़ों से भरा है।  विजय मंदिर पैलेस उस समय राजस्थान के राजाओं के शाही जीवन का प्रदर्शन करते हैं। महल परिसर के भीतर एक सुंदर सीता राम मंदिर है, जो भक्तों और दर्शकों के साथ भीड़ में आते हैं। महल के भूतल को सरकारी कार्यालयों और जिला अदालतों में बदल दिया गया है, ऊपरी मंजिला वर्तमान में एक संग्रहालय है। महल का दौरा करने के लिए सचिव से पूर्व अनुमति की आवश्यकता है\n",
                  style: TextStyle(fontSize: 20),
                ),
              ],
            ),
          ),
        ),
      ),
    ]));
  }
}
