import 'package:flutter/material.dart';
import 'package:flutter/src/widgets/container.dart';
import 'package:flutter/src/widgets/framework.dart';

class Mount_abu extends StatefulWidget {
  const Mount_abu({super.key});

  @override
  State<Mount_abu> createState() => _Mount_abuState();
}

class _Mount_abuState extends State<Mount_abu> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: ListView(children: [
      Center(
        child: Material(
          child: Container(
            decoration: BoxDecoration(
                borderRadius: BorderRadius.circular(10),
                color: Color.fromARGB(255, 255, 252, 252)),
            padding: EdgeInsets.all(15),
            width: MediaQuery.of(context).size.width * 8,
            // height: 900,
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                ClipRRect(
                  borderRadius: BorderRadius.circular(5),
                  child: Image.asset(
                    "Assets/image/38.jpg",
                    fit: BoxFit.fill,
                    height: 170,
                    width: double.maxFinite,
                  ),
                ),
                SizedBox(
                  height: 8,
                ),
                Image.asset(
                  "Assets/image/40.jpg",
                  fit: BoxFit.fill,
                  height: 170,
                  width: double.maxFinite,
                ),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Mount abu \n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "माउंट अबू समुद्र तल से ऊपर 1,21 9 मीटर की औसत ऊंचाई पर स्थित है, राजस्थान के सुनसान भूमि में ओएसिस है और राजस्थान में एकमात्र हिल स्टेशन के साथ-साथ उत्तर-पश्चिम भारत होने का सम्मान भी है, विश्व प्रसिद्ध पर्यटन स्थल ज्ञात है अरवली पर्वत में सबसे ऊंची चोटी पर हरे भरे वनों वाली पहाड़ियों के बीच स्थित इसके देवरिला जैन मंदिरों और प्राकृतिक सौंदर्य के लिए भी भारतीय राज्य राजस्थान के लिए ग्रीष्मकालीन राजधानी है, झीलों और हरे वनों, पहाड़ी वापसी, अपने समृद्ध वनस्पतियों के लिए एक बहुत ही शांत और सुखदायक जलवायु है, जिसमें पूरे ढाल को कवर किया गया है जिसमें शंकुधारी पेड़ों और फूलों के झुंड शामिल हैं। माउंट अबू, अपने क्लास-क्लास टूरिस्ट की सुविधा के साथ होटल से लेकर बजट वर्ग से लेकर तीन सितारा और विरासत तक एक महान छुट्टी से बच और हनीमून आकर्षण प्रदान करता है। हर साल 30 लाख से अधिक राष्ट्रीय और अंतर्राष्ट्रीय पर्यटक माउंट आबू की अपनी प्राकृतिक सुंदरता, समृद्ध वनस्पतियों और जीवों का आनंद लेते हैं और साथ ही साथ Delwara जैन मंदिरों की संगमरमर कला का दौरा करते हैं। माउंट अबू को 1 9 65 के बाद से बंद क्षेत्र घोषित किया गया है। हालांकि, 328 वर्ग किमी का पूरा क्षेत्र अबू हिल्स की संरक्षित घोषित की गई लेकिन आधिकारिक तौर पर 112.98 वर्ग किमी अनहॉटेड अभयारण्य क्षेत्र (अनन।, 2003) के अंतर्गत है आकार में, माउंट। अबू वन्यजीव अभ्यारण्य लंबी और संकीर्ण है, लेकिन यह शीर्ष सुरम्य पठार में फैलता है, जो लगभग 19 किमी लंबी और 5-8 किमी चौड़ी है। ध्यान ऋषि और मुनीस के घर जाने के बाद, पौराणिक कथा यह है कि माउंट आबू 33 करोड़ देवताओं और देवी का घर है पौराणिक कथा के अनुसार अबू नाम का अर्थ है हिमालय का बेटा (या आर-बुडा, “ज्ञान का पहाड़ी”), इसका नाम अरबुडा से है – शक्तिशाली सर्प, जिसने नंदी भगवान शिव के पवित्र बैल को बचाया। माउंट आबू, कई ऋषियों और मुनीओं (ऋषियों और संतों) के लिए घर पर हैं, जिसमें प्रसिद्ध ऋषि वशिष्ठ भी शामिल हैं, जिन्हें माना जाता है कि आग लगने से चार अग्निबल राजपूत परिवार बनाए गए हैं, यज्ञ या अग्नि बलिदान करके, रक्षा करने के लिए राक्षसों से पृथ्वी  ऐतिहासिक समय में, माउंट आबू सिरोही के महाराजा से ईस्ट-इंडिया कंपनी (ब्रिटिश साम्राज्य) पर पट्टे पर था, माउंट आबू को 1 9 47 तक राजपूताना के निवासी के लिए मुख्यालय के रूप में इस्तेमाल किया गया था और सैनिकों के लिए अस्पताल के रूप में अरविल्यास कभी ऐसा नहीं लग रहा था माउंट अबू हिल स्टेशन के लिए सर्पिल सड़कों, राजस्थान का एकमात्र हिल स्टेशन, हर बार जब यात्रा की जाती है तो फंतासी पकड़ती है। और गर्मियों के छोटे शहरों की तुलना में कोई शुरुआत बेहतर नहीं है, जो कि पहाड़ी शहर के बाद काफी मांग की गई है। सूर्योदय किस तरह से हो सकता है और सूर्यास्त केवल उन्मत्त मनुष्यों को कैसे छोड़ सकता है, इसका पूर्ण अर्थ केवल माउंट आबू में और इसी तरह के स्थान पर होता है। इन सभी कल्पनाओं और अधिक वास्तविकता का आकार दौरे के फैसले के साथ ले जाता है। Also Visit – Udaipur Mount Abu Tour Package अरवल्ली हिल्स, जहां माउंट आबू स्थित है, अजीब सुंदरता के हैं जो समझने में मुश्किल है कि क्या राजस्थान में सिर्फ जैसलमेर के रेत के टीलों को देखा है। कुछ नदियों, झीलों, झरनों, आदि के घर होने के लिए ‘रेगिस्तान के नखलिस्तान’ के रूप में माना जाता है, यह पहाड़ी गंतव्य राजस्थान की जलती हुई गर्मी से राहत है जो लगभग 66% रेगिस्तान है। इस प्रकार माउंट आबू यात्रा राजपूत योद्धाओं से जुड़े राज्य के अन्य हिस्सों के विपरीत एक अलग विपरीत प्रस्तुत करता है। प्राचीन ग्रंथों में यह जगह ‘अर्बुडा पर्वत’ के रूप में विख्यात है, जो गुर्जर से जुड़ा था जो यहां रहते थे लेकिन बाद में राजस्थान और गुजरात दोनों के अन्य स्थानों पर चले गए। सत्तारूढ़ सत्ता के परिवर्तन और बाद में मुगलों और ब्रिटिश राज के बाद में इस जगह का इतिहास और महत्व कम हो गया। हालांकि, अब यह स्थान प्राकृतिक सुंदरता के लिए बहुत अधिक मांग है जिसके साथ यह अपने घरेलू आगंतुकों की पकड़ लेती है और विदेशी लोगों में यह लोकप्रिय है, इसके लिए आध्यात्मिक आकर्षण। ये दो पर्वत आबू पर्यटन की महत्वपूर्ण विशेषताएं हैं। माउंट आबू, राजस्थान में एकमात्र हिल स्टेशन, यह सिर्फ एक गर्मियों में पीछे हटने से ज्यादा है 11 वीं से 13 वीं शताब्दी की पुरानी, ​​दिलवाड़ा जैन मंदिरों के शानदार चौराहे, यह एक लोकप्रिय तीर्थस्थान केंद्र है। इस छोटे से पहाड़ी रिज़ॉर्ट में लोक नृत्य और सामान्यता का सामान्य वातावरण होता है जिससे यह एक जगह बनता है जहां कोई व्यक्ति पूरी तरह से आराम कर सकता है।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/41.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/42.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Dilwara Jain Temple\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "दिलवाड़ा जैन मंदिर, भारत के प्रमुख जैन तीर्थस्थलों में से एक है। राजस्थान के माउंट आबू के पास ही स्थित इस दिलवाड़ा मंदिर (Dilwara Mandir) में पाँच जैन मंदिर शामिल हैं जो अपनी धार्मिक और वास्तुकला की महत्ता के लिए प्रमुख तौर पर जाने जाते हैं। इन मंदिरों का निर्माण 11वीं से 13वीं शताब्दी के बीच में हुआ था। दिलवाड़ा जैन मंदिर प्रथम जैन तीर्थंकर आदिनाथ को समर्पित है। इस मंदिर को 11वीं से 13वीं शताब्दी के दौरान चालुक्य राजाओं वास्तुपाल और तेजपाल नामक दो भाईयों द्वारा 1231 ई. में बनवाया गया था। जैन वास्तुकला के सर्वोत्कृष्ट उदाहरण-स्वरूप दो प्रसिद्ध संगमरमर के बने मंदिर जो दिलवाड़ा या देवलवाड़ा मंदिर कहलाते हैं इस पर्वतीय नगर के जगत् प्रसिद्ध स्मारक हैं। विमलसाह ने पहले कुंभेरिया में पार्श्वनाथ के 360 मंदिर बनवाए थे किंतु उनकी इष्टदेवी अंबा जी ने किसी बात पर नाराज होकर पाँच मंदिरों को छोड़ अवशिष्ट सारे मंदिर नष्ट कर दिए और स्वप्न में उन्हें दिलवाड़ा में आदिनाथ का मंदिर बनाने का आदेश दिया। किंतु आबूपर्वत के परमार नरेश ने विमलसाह को मंदिर के लिए भूमि देना तभी स्वीकार किया जब उन्होंने संपूर्ण भूमि को रजतखंडों से ढक दिया। इस प्रकार 56 लाख रुपय में यह ज़मीन ख़रीदी गई थी। इन मंदिरों की भव्यता उनके वास्तुकारों की भवन-निर्माण में निपुणता, उनकी सूक्ष्म पैठ और छेनी पर उनके असाधारण अधिकार का परिचय देती है। इन मंदिर की प्रमुख विशेषता यह है की सभी की छतों, द्वारों, तोरण, सभा-मंडपों का उत्कृष्ट शिल्प एक दूसरे से बिल्कुल भिन्न है। पांच मंदिरों के इस समूह में दो विशाल मंदिर हैं और तीन उनके अनुपूरक। मंदिरों के प्रकोष्ठों की छतों के गुंबद व स्थान-स्थान पर उकेरी गयीं सरस्वती, अम्बिका, लक्ष्मी, सव्रेरी, पद्मावती, शीतला आदि देवियों की दर्शनीय प्रतिमाएं इनके शिल्पकारों की छेनी की निपुणता के साक्ष्य खुद-ब-खुद प्रस्तुत कर देती हैं। यहां उत्कीर्ण मूर्तियों और कलाकृतियों में शायद ही कोई ऐसा अंश हो जहां कलात्मक पूर्णता के दर्शन न होते हों। शिलालेखों और ऐतिहासिक अभिलेखों के अनुसार प्राचीन काल में यह स्थल अबू नागा जनजाति का प्रमुख केंद्र था। महाभारत में अबू पर्वत में महर्षि वशिष्ठ के आगमन का उल्लेख मिलता है। इसी तरह जैन शिलालेखों के अनुसार जैन धर्म के संस्थापक भगवान महावीर ने भी यहां के निवासियों को उपदेश दिया था। दिलवाड़ा जैन मंदिर प्राचीन वास्तुकला का एक उत्कृष्ट उदाहरण हैं। यह शानदार मंदिर जैन धर्म के र्तीथकरों को समर्पित हैं। इस मंदिर में जैन धर्म के कई तीर्थंकरों जैसे आदिनाथ जी, नेमिनाथ जी, पार्श्वनाथ जी और महावीर जी की मूर्तियां स्थापित हैं। इस देवालय में देवरानी-जेठानी मंदिर भी है जिनमें भगवान आदिनाथ और शांतिनाथ की प्रतिमाएं स्थापित है।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/43.webp",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/44.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Achalgarh Fort \n",
                  style: TextStyle(
                      color: Colors.black,
                      fontSize: 20,
                      fontWeight: FontWeight.bold),
                ),
                Text(
                  "अचलगढ़ किला का निर्माण मूल रूप से परमारा वंश के शासनकाल में करबाया गया था, और कुछ समय बाद महाराणा कुंभा ने अचलगढ़ किले को सन 1452 ई में दुश्मनो की हरकतों पर नजर रखने के उद्देश्य से इसका पुनिर्निर्माण करबाया गया था। जो उनके उनके शासनकाल के दौरान बनाए गए 32 किलों में से एक था। और कुछ समय बाद किले के अन्दर 1513 ई एक जैन मंदिर का निर्माण भी किया गया था । अचलगढ़ किले के पहले द्वार को हनुमानपोल के नाम से जाना जाता है, जो निचले किले के प्रवेश द्वार के रूप में कार्य करता था। जिसमे ग्रेनाइट के बड़े ब्लॉकों से बने दो टॉवर शामिल हैं। कुछ चढ़ाई के बाद, किले के दूसरे द्वार चंपापोल को बनाया गया है, जो आंतरिक किले के प्रवेश द्वार के रूप में कार्य करता है। अगर आप अचलगढ़ क़िला घूमने का प्लान बना रहे है तो बता दे की अचलगढ़ क़िला पर्यटकों के घूमने के लिए प्रतिदिन सुबह 10.00  बजे से शाम 5.00 बजे तक खुला रहता है। अचलगढ़ क़िला घूमने के लिए पर्यटकों से किसी भी प्रकार का शुल्क नही लिया जाता है यह भारतीय और विदेशी सभी प्रकार के पर्यटकों के लिए फ्री है।  1)अगर आप अचलगढ़ क़िला की यात्रा का प्लान बना रहे है तो आपको बता दे की यहाँ के मंदिरों में खासकर जैन मंदिरों के अंदर फोटोग्राफी की अनुमति नहीं है। 2)अचलगढ़ क़िला की यात्रा के लिए आरामदायक जूते पहन कर चले क्योंकि यहाँ कुछ मंदिरों में जाने के लिए पैदल चलना पड़ सकता है । 3)यात्रा के दोरान गर्मी से खुद को बचाने के लिए हमेशा छाता और उचित कपडे पहन कर चले। 4)अचलगढ़ क़िला की यात्रा में अपने साथ पानी की बोतल अवश्य साथ ले कर चले।5)हमें आपको यह बताते हुए खेद है कि अचलगढ़ किला के आसपास के क्षेत्र में गाइड उपलब्ध नहीं हैं। हम आपको अधिक जानकारी और ऐतिहासिक ज्ञान के लिए एक यात्रा पुस्तक खरीदने या वेब सेवाओं का उपयोग करने का सुझाव देंगे ।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/45.png",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/46.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Guru Shikhar \n",
                  style: TextStyle(
                      fontSize: 20,
                      fontWeight: FontWeight.bold,
                      color: Color.fromRGBO(0, 0, 0, 1)),
                ),
                Text(
                  " गुरु शिखर, माउंट आबू में स्थित ऐसा स्थान है जो राजस्थान में पर्यटकों द्वारा घूमे जाने वाले सबसे खास पर्यटन स्थलों में से एक है। बता दें कि अगर आप शहर के तेज और व्यस्त जीवन से बचना चाहते हैं तो गुरु शिखर से अच्छा स्थान आपके लिए शायद ही कोई होगा। माउंट आबू से लगभग 15 किलोमीटर की दूरी पर स्थित गुरु शिखर अरावली रेंज की सबसे ऊँची चोटी है। गुरु शिखर की समुद्र तल से 1722 मीटर उंचाई है, जिसकी वजह से यहां से अरावली रेंज और माउंट आबू के हिल स्टेशन का मनमोहक दृश्य नज़र आता है। इस शिखर पर माउंट आबू वेधशाला और गुरु दत्तात्रेय का गुफा मंदिर, जिसमे भगवान विष्णु की पूजा होती है। माउंटअबू वेधशाला (Mt.Abu Observatory) में 1.2 मीटर इंफ्रारेड टेलीस्कोप है। यह वेधशाला अनुकूल मेघ परिस्थितियों की वजह से यहाँ स्थित है। गुरु शिखर की यात्रा करने के लिए आपको 15 किलोमीटर की ड्राइव के बाद, आपको चोटी पर जाने के लिए कुछ सीढ़ियां चढ़नी होंगी। गुरु शिखर को शुरू के शिखर भी कहा जाता है। आपको बता दें कि इसका नाम गुरु दत्तात्रेय के नाम पर रखा गया था जिसके बारे में ऐसा कहा जाता है वो एक साधू के रूप में अपने दिनों में इस चोटी पर निवास करते थे। वे भगवान ब्रह्मा, विष्णु और शिव के अवतार के रूप में जाने जाते हैं। इस शिखर के ऊपर गुफा को उनके स्मरण के रूप में मंदिर के रूप में बदल दिया गया है। गुरु का नाम दत्तात्रेय दो शब्दों से मिलकर बना हुआ है, आत्रेय और दत्ता। आत्रेय का अर्थ है अत्रि का पुत्र, अत्रि हिंदू पौराणिक कथाओं के एक ऋषि हैं जिन्होंने कई संख्या में भजनों की रचना की थी। यहां पर में एक मंदिर भी स्थित है जो दत्तात्रेय की माता अनसूया के समर्पण में बना हुआ है। बता दें कि गुरु दत्तात्रेय को भगवान विष्णु का एक अवतार माना जाता था, जिसके चलते यह मंदिर बहुत ज्यादा पवित्र स्थान बन गया है। यह जगह दत्तात्रेय और स्वामी रामनाथ चरणों का घर है। राजस्थान का एक मात्र हिल स्टेशन शिखर माउंट आबू वेधशाला(Observatory) का घर भी है। यह नवंबर 1994 से पूरी तरह से काम कर रहा है और इसरो की एक सुविधा है। इस वेधशाला को विशेष रूप से आकाशीय पिंडों के ग्राउंड-आधारित अवरक्त अवलोकनों का अध्ययन करने के लिए बनाया गया है। यह वेधशाला इसरो के सबसे महत्वपूर्ण इन्फ्रास्ट्रक्चर्स में से एक है। अगर आप गुरु शिखर की यात्रा करने जा रहे हैं तो आपके लिए सुबह पैदल यात्रा करना दो कारणों से काफी अच्छा साबित हो सकता है। पहला कारण लुभावने सूर्योदय का दृश्य और दूसरा दुकानों द्वारा परोसा जाने वाला नाश्ता। यहां रस्ते के किनारे पर स्थित दुकानें बहुत ही स्वादिष्ट नाश्ता बेचती हैं और इनकी चाय भी काफी अच्छी होती है। यहां आप दिन के किसी भी समय अच्छा भोजन प्राप्त कर सकते हैं। खाने की दुकानों के अलावा यहां पर कई ऐसी दुकानें भी है जो सुंदर स्मृति चिन्ह बेचती हैं। यहां के आकर्षक दृश्य फोटोग्राफी के लिए बहुत अच्छे हैं। अपनी गुरु शिखर की यात्रा के दौरान आप दत्तात्रेय के मंदिर के दर्शन करने के लिए भी जा सकते हैं, जो आपकी यात्रा में एक पवित्र स्पर्श जोड़ देगा। \n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/47.webp",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/48.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Arbuda Devi Temple\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "अर्बुदा देवी मन्दिर राजस्थान के माउंट आबू में स्थित है। अर्बुदादेवी आबू की अधिष्ठात्री देवी हैं। यह स्थान 51 शक्तिपीठों में से एक है। माना जाता है कि इस स्थान पर मां पार्वती के होंठ गिरे थे। आबू पर्वत शाक्त धर्मका प्रमुख केन्द्र और अर्बुदेश्वरी का निवास माना जाता था। मां अर्बुदा देवी की पूजा माता कात्यायनी देवी के स्वरूप में की जाती है। मां अर्बुदा देवी का मंदिर मांउंट आबू से 3 कि.मी. दूर एक पहाड़ी पर स्थित है। अर्बुदा देवी, अधर देवी और अम्बिका देवी के नाम से प्रसिद्ध है। यह मंदिर एक प्राकृतिक गुफा में प्रतिष्ठित है। इस मंदिर की स्थापना साढ़े पांच हजार वर्ष पूर्व हुई थी। सफेद संगमरमर से बना यह छोटा सा मन्दिर एक ऊँची और विशाल पहाड़ी के बीचोंबीच में स्थित है और बहुत भव्य और आकर्षक लगता है। अष्टमी की रात्रि यहां महायज्ञ होता है जो नवमी के सुबह तक पूर्ण होता है। नवरात्रों में यहां निरंतर दिन-रात अखंड़ पाठ होता है। पौराणिक मान्यताअों के अनुसार इस स्थान पर मां पार्वती के होंठ गिरे थे। तभी से यह स्थान अधर देवी के नाम से जाना जाता है। अर्बुदा देवी की पूजा छठे दिन माता कात्यायनी के स्वरूप में की जाती है। भक्तजन मंदिर में सैकड़ों मीटर की यात्रा के पश्चात 350 सीढ़ियों को चढ़कर के मां के दर्शनों के लिए आते हैं। अर्बुदा देवी के निज मन्दिर में प्रवेश के लिए श्रद्धालुओं को गुफा के संकरे मार्ग में होकर बैठकर जाना पड़ता है। मन्दिर की गुफा के प्रवेश द्वार के समीप एक शिव मन्दिर भी बना है। श्री अर्बुदा देवी ही षष्टम दुर्गा कात्यायिनी दुर्गा है। इस देवी ने अपनी लीला से आबू में यज्ञ कुण्ड की ज्वाला से परमार और परिहार राजपूतों के आदि पुरुषों को प्रकट किया। अतः यह देवी परमार और परिहार जाति के राजपूतों की कुलदेवी कहलाई। परमार और परिहार जाति के जिन जिन राजपूतों को जैन आचार्यों ने प्रतिबोधित कर महाजन बनाया उन सभी की कुलदेवी श्री अधर देवी है। यहां पर अर्बुदा देवी का चरण पादुका मंदिर भी स्थित है। माता के चरण पादुका के नीचे उन्होंने बासकली राक्षस का संहार किया था। मां कात्यायनी के बासकली वध की कथा पुराणों में मिलती है। पौराणिक कथा के अनुसार दैत्य राजा कली जिसको बासकली के नाम से जाना जाता था। उसने हजारों वर्ष तप करके भोलेनाथ को प्रसन्न कर उनसे अजेय होने का वर प्राप्त किया। बासलकी वरदान प्राप्त कर घमंडी हो गया। उसने देवलोक में इंद्र सहित सभी देवताओं को कब्जे में कर लिया। देवता उसके आतंक से दुखी होकर जंगलों में छिप गए। देवताअों ने कई वर्षों तक तप करके मां अर्बुदा देवी को प्रसन्न किया। माता ने प्रसन्न होकर तीन स्वरूपों में दर्शन दिया। देवताअों ने माता से बासकली से मुक्ति दिलाने का वर मांगा। मां ने उन्हें तथास्तु कहा। माता ने बासकली राक्षस को अपने चरणों से दबा कर उसे मुक्ति प्रदान की। उसके पश्चात यहा मां के चरण पादुका की पूजा होने लगी। मान्यता के अनुसार नवरात्र के दिनों में माता के दर्शन मात्र से व्यक्ति को प्रत्येक दुखों से मुक्ति मिल जाती है अौर भक्तों को मोक्ष की प्राप्ति होती है। नवरात्रों में यहां बहुत संख्या में भक्त मां के दर्शनों के लिए आते हैं। नवरात्र के छठे दिन मां अर्बुदा अर्थात माता कात्यायनी के दर्शनों के लिए यहां भक्तों की सुबह से ही भीड़ जमा हो जाती है। \n",
                  style: TextStyle(fontSize: 20),
                ),
              ],
            ),
          ),
        ),
      ),
    ]));
  }
}
