import 'package:flutter/material.dart';

class Udaipur extends StatefulWidget {
  const Udaipur({super.key});

  @override
  State<Udaipur> createState() => _UdaipurState();
}

class _UdaipurState extends State<Udaipur> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: ListView(children: [
      Center(
        child: Material(
          child: Container(
            decoration: BoxDecoration(
                borderRadius: BorderRadius.circular(10),
                color: Color.fromARGB(255, 255, 252, 252)),
            padding: EdgeInsets.all(15),
            width: MediaQuery.of(context).size.width * 8,
            // height: 900,
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                ClipRRect(
                  borderRadius: BorderRadius.circular(5),
                  child: Image.asset(
                    "Assets/image/29.jpg",
                    fit: BoxFit.fill,
                    height: 170,
                    width: double.maxFinite,
                  ),
                ),
                SizedBox(
                  height: 8,
                ),
                Image.asset(
                  "Assets/image/30.jpg",
                  fit: BoxFit.fill,
                  height: 170,
                  width: double.maxFinite,
                ),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Haldighati  Kiley \n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "हल्दीघाटी का युद्ध 18 जून 1576 ई. को खमनोर एवं बलीचा गांव के मध्य तंग पहाड़ी दर्रे से आरम्भ होकर खमनोर गांव के किनारे बनास नदी के सहारे मोलेला तक कुछ घंटों तक चला था। युद्ध में निर्णायक विजय किसी को भी हासिल नहीं हो सकी थी। इस युद्ध मे महाराणा प्रताप के सहयोगी राणा पूंजा का सहयोग रहा ।इसी युद्ध में महाराणा प्रताप के सहयोगी झाला मान, हाकिम खान,ग्वालियर नरेश राम शाह तंवर सहित देश भक्त कई सैनिक देशहित बलिदान हुए। उनका प्रसिद्ध घोड़ा चेतक भी मारा गया था। अब यहां मुख्य रूप से देखने योग्य युद्ध स्थल रक्त तलाई,शाहीबाग,हल्दीघाटी दर्रा,प्रताप गुफा,चेतक समाधी एवं महाराणा प्रताप स्मारक देखने योग्य है। युद्धभूमि रक्त तलाई में शहीदों की स्मृति में बनी हुई है। भारतीय पुरातत्व विभाग द्वारा संरक्षित सभी स्थल निःशुल्क दर्शनीय है। सरकारी संग्रहालय नहीं होने से यहाँ निजी प्रतिष्ठान द्वारा हल्दीघाटी से 3 किलोमीटर दूर बलीचा गांव में संग्रहालय के नाम पर 100 रुपया प्रवेश शुल्क लेकर व्यापारिक मॉडल बना रखा है। पर्यटकों को मूल स्थलों से भ्रमित किया जाना सोचनीय है। ऐसा कहा जाता है कि हल्दीघाट की लड़ाई के बाद, राणा प्रताप मुगलों पर हमला करते रहे, जिसे गुरिल्ला युद्ध की तकनीक कहा जाता है। वह पहाड़ियों में रहे और वहाँ से बड़े मुगल सेनाओं को अपने शिविरों में परेशान किया। उन्होंने यह सुनिश्चित किया कि मेवाड़ में मुगल सैनिक कभी भी शांति से नहीं रहेंगे। प्रताप को पहाड़ों में उनके ठिकानों से बाहर निकालने के लिए अकबर की सेना द्वारा तीन और अभियान चलाए गए, लेकिन वे सभी विफल रहे। उसी दौरान, राणा प्रताप को भामाशाह नामक एक शुभचिंतक से वित्तीय सहायता मिली। भील आदिवासियों ने जंगलों में रहने के लिए अपनी विशेषज्ञता के साथ प्रताप को सहायता प्रदान की। झुलसी हुई धरती का उपयोग करते हुए युद्ध के लिए उनकी अभिनव रणनीति, दुश्मन के क्षेत्रों में लोगों की निकासी, कुओं का ज़हर, अरावली में पहाड़ी किलों और गुफाओं का उपयोग, लगातार लूटपाट, लूटपाट और दुश्मन के कैंपों को ध्वस्त करने में मदद मिली, जिससे उन्हें बहुत राहत मिली। मेवाड़ के प्रदेशों को खो दिया। उन्होंने राजस्थान के कई क्षेत्रों को मुग़ल शासन से मुक्त कर दिया। साल बीतते गए और 1597 में प्रताप की शिकार की दुर्घटना में मृत्यु हो गई। उन्होंने अपने बेटे अमर सिंह को अपना उत्तराधिकारी बनाया।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/31.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 9,
                ),
                Image.asset("Assets/image/32.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Kumbhalgarh kiley\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "कुम्भलगढ़ किला मेवाड़ के प्रसिद्ध किलो में से एक है, जो अरावली पर्वत पर स्थित है। यह किला भारत के पश्चिम में राजस्थान के उदयपुर जिले के राजसमंद में स्थित है। यह एक वर्ल्ड हेरिटेज साईट है जो राजस्थान की पहाडियों में स्थित है। इसका निर्माण 15 वी शताब्दी में राणा कुम्भ ने किया था, कुम्भलगढ़ महान शासक महाराणा प्रताप की जन्मभूमि भी है। महाराणा प्रताप मेवाड़ के महान शासक और वीर योद्धा थे। जिनका 19 वी शताब्दी तक किले पर कब्ज़ा था, लेकिन आज यह किला सामान्य लोगो के लिये भी खुला है। कुम्भलगढ़ उदयपुर से रोड वाले रास्ते से 82 किलोमीटर दूर है। चित्तोडगढ के बाद मेवाड़ के मुख्य किलो में यह भी शामिल है। मेवाड़ के सबसे बेहतरीन और प्रसिद्ध किलो में कुम्भलगढ़ किले Kumbhalgarh fort की गिनती की जाती है। 2013 मे, कंबोडिया के पेन्ह में आयोजित वर्ल्ड हेरिटेज कमिटी के 37 वे सेशन में कुम्भलगढ़ किले के साथ-साथ राजस्थान के दुसरे बहुत से किलो को भी वर्ल्ड हेरिटेज साईट घोषित किया गया। यूनेस्को ने राजस्थान के किलो की सूचि में इसे शामिल किया है। किले की 38 किलोमीटर की दीवार के साथ, यह किला ग्रेट वॉल ऑफ़ चाइना के बाद यह सबसे विशाल दीवार वाला दूसरा किला है और चित्तौड़गढ़ किले के बाद यह राजस्थान के बाद दुसरा सबसे बड़ा किला है। इस किले के इतिहास को लेकर प्रयाप्त जानकारी उपलब्ध ना होने के कारण हम इस किले के इतिहास को लेकर ज्यादा कुछ नही कह सकते। कहा जाता है की इस किले का प्राचीन नाम मछिन्द्रपुर था, जबकि इतिहासकार साहिब हकीम ने इसे माहौर का नाम दिया था। माना जाता है की वास्तविक किले का निर्माण मौर्य साम्राज्य के राजा सम्प्रति ने छठी शताब्दी में किया था। 1303 AD में अलाउद्दीन खिलजी के आक्रमण करने से पहले का इतिहास आज भी अस्पष्ट है। आज जिस कुम्भलगढ़ किले को देखते है उसका निर्माण हिन्दू सिसोदिया राजपूतो ने करवाया और वही कुम्भ पर राज करते थे। आज जिस कुम्भलगढ़ को हम देखते है उसे प्रसिद्ध आर्किटेक्ट एरा मदन ने विकसित किया था और अलंकृत किया था। राणा कुम्भ का मेवाड़ साम्राज्य रणथम्बोर से ग्वालियर तक फैला हुआ है जिनमे मध्यप्रदेश राज्य का कुछ भाग और राजस्थान भी शामिल है। कुल 84 किले उनके अधिराज्य में थे, कहा जाता है की राणा कुम्भ ने उनमे से 32 किलो को डिजाईन किया था। कुम्भलगढ़ ने मेवाड़ और मारवाड़ को भी अलग-अलग किया है और उस समय मेवाड़ के शासको द्वारा इन किलो का उपयोग किया जाता था। एक प्रसिद्ध घटना यहाँ राजकुमार उदय को लेकर घटित हुई थी, 1535 में इस छोटे राजकुमार की यहाँ तस्करी की गयी थी, उस समय चित्तोड़ घेराबंदी में था।बाद में राजकुमार उदय ने ही उदयपुर शहर की स्थापना की थी। इसके बाद यह किला सीधे हमले के लिये अभेद्य ही रहा और एक बाद पानी की कमी की वजह से ही किले को थोड़ी क्षति पहुची थी। अम्बेर के राजा मान सिंह, मारवाड़ के राजा उदय सिंह, मुघल सम्राट अकबर और गुजरात में मिर्ज़ा के लिये पानी की कमी को पूरा करने की वजह से यहाँ पानी की कमी आयी थी। गुजरात के अहमद शाह प्रथम ने 1457 में किले पर आक्रमण किया था लेकिन उनकी कोशिश व्यर्थ गयी। स्थानिक लोगो का ऐसा मानना है की किले में स्थापित बनमाता देवी ही किले की रक्षा करती है और इसीलिए अहमद शाह प्रथम किले को तोडना चाहता था। इसके बाद 1458-59 और 1467 में महमूद खिलजी ने किले पर आक्रमण करने की कोशिश की थी लेकिन वह भी असफल रहा। कहा जाता है की 1576 से किले पर अकबर के जनरल शब्बाज़ खान का नियंत्रण था। 1818 में सन्यासियों के समूह ने किले की सुरक्षा करने का निर्णय लिया था लेकिन फिर बाद में किले पर मराठाओ ने अधिकार कर लिया था। इसके बाद किले में मेवाड़ के महाराणा ने कुछ बदलाव भी किये थे लेकिन वास्तविक किले का निर्माण महाराणा कुम्भ ने ही किया था। और बाद में किले की बाकी इमारतो और मंदिर की सुरक्षा भी की गयी थी।कुम्भलगढ़ किले की संस्कृति राजस्थान पर्यटन विभाग हर साल महाराणा कुम्भ की याद में तीन दीन एक विशाल महोत्सव का आयोजन कुम्भलगढ़ में करता है। तीन दिन के इस महोत्सव में किले को रौशनी से सजाया जाता है। इस दौरान नृत्य कला, संगीत कला का प्रदर्शन भी स्थानिक लोग करते है। इस महोत्सव में दूसरी बहुत सी प्रतियोगिताओ का भी आयोजन किया जाता है जैसे की किला भ्रमण, पगड़ी बांधना, युद्ध के लिये खिंचा तानी और मेहंदी मांडना इत्यादि। राजस्थान के छः किले मुख्यतः आमेर का किला, चित्तोडगढ किला, जैसलमेर किला, कुम्भलगढ़ किला और रणथम्बोर किले को जून 2013 में पेन्ह में आयोजित वर्ल्ड हेरिटेज साईट की 37 वी मीटिंग में इन्हें यूनेस्को वर्ल्ड हेरिटेज साईट में  शामिल किया गया था। राजपूताने की शान के नाम से मशहूर कुम्भलगढ़ किले से एक तरफ सैकड़ो किलोमीटर में फैले अरावली पर्वत श्रृंखला की हरियाली दिखाई देती हैँ जिनसे वो घिरा हैँ, वहीँ दूसरी तरफ थार रेगिस्तान के रेत के टीले भी दिखते हैँ। कहा जाता है की कुम्भलगढ़ किले को देश का सबसे मजबूत दुर्ग माना जाता है जिसे आज तक सीधे युद्ध में जीतना नामुमकिन है। गुजरात के अहमद शाह से लेकर महमूद ख़िलजी सभी ने आक्रमण किया लेकिन कोई भी युद्ध में इसे जीत नही सका।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/33.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Ranakpur Jain Timple\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontSize: 20,
                      fontWeight: FontWeight.bold),
                ),
                Text(
                  "भारत के राजस्थान में स्थित रणकपुर जैन मंदिर अपनी भव्यता, विशालता और सुंदरता के लिए काफी मशहूर है। जैन धर्म के प्रमुख 5 धार्मिक स्थलों में से एक रणकपुर जैन मंदिर, जैन तीर्थकर आदिनाथ जी को समर्पित है। रणकपुर जैन मंदिर उदयपुर के पाली जिले के सादड़ी में स्थित है। जोधपुर और उदयपुर के बीच में अरावली पहाड़ियों के पश्चिमी तरफ रणकपुर जैन मंदिर है, चारों तरफ जंगलों से घिरे इस प्राचीन जैन मंदिर की सुंदरता देखते ही बनती है।  अपनी भव्यता और खूबसूरत नक्काशी के लिए मशहूर इस प्राचीन जैन मंदिर को बनाने की शुरुआत आज से करीब 600 साल पहले 1446 विक्रम संवत में हुई थी, इस मंदिर को बनाने में 50 साल से भी ज्यादा का समय लगा और इसके निर्माण में करीब 99 लाख रुपए की राशि का खर्च आया था। हालांकि, जैन धर्म के इस भव्य मंदिर के रखरखाव की जिम्मेदारी विक्रम संवत 1953 में एक ट्रस्ट को दे दी गई, जिसके बाद इस मंदिर का पुनरुद्दार कर इसे खूबसूरत और नया रुप दिया गया। आपको बता दें कि रणकपुर जैन मंदिर (Ranakpur Jain Mandir) के निर्माण के बारे में यह कहा जाता है कि, इसका निर्माण आचार्य श्यामसुंदर जी,देपा, कुंभा राणा और धरनशाह नामक चार भक्तों ने करवाया था। आचार्य श्यामसुंदर एक धार्मिक प्रवृत्ति के नेता थे, जबकि राणा कुंभा, मलगढ़ के राजा और धरनशाह के मंत्री थे, धार्मिक भावनाओं से प्रेरित होकर धरनशाह ने भगवान श्रषभदेव का मंदिर बनवाने का फैसला लिया था, ऐसा भी कहा जाता है कि एक बार रात के समय उन्हें सपने में एक बेहद सुंदर और पवित्र विमान ‘नलिनीगुल्मा विमान’ के दर्शन हुए थे, जिसके बाद धरनशाह ने इस मंदिर का निर्माण करवाने का फैसला लिया था। वहीं रणकपुर जैन मंदिर के निर्माण के लिए बुलाए गए कई वास्तुकारों में सिर्फ मुंदारा के साधारण वास्तुकार दीपक की कारीगरी की योजना धरनशाह को पसंद आई थी। मलगढ़ के राजा राणा कुंभा ने इसके बाद रणकपुर जैन मंदिर को बनवाने के लिए धरनशाह को जमीन दे दी, इसके साथ ही एक नगर बसाने के लिए भी कहा। राणा कुंभा के नाम पर इस मंदिर को पहले रणपुर कहा गया और फिर बाद में यह मंदिर रणकपुर जैन मंदिर के नाम से जाना गया। करीब 40,000 वर्ग फीट वाले क्षेत्रफल में रणकपुर जैन मंदिर (Ranakpur Jain Mandir) की विशाल इमारत बनी हुई है। इस मंदिर में चार कलात्मक प्रवेश द्धार भी है, और इसके परिसर में कई अन्य मंदिर भी बने हुए हैं, मंदिर के मुख्य गृह में जैन तीर्थकर आदिनाथ की संगममर से बनी करीब 72 इंच ऊंची 4 भव्य और विशाल मूर्तियां शोभायमान हैं, जो कि चार अलग-अलग दिशाओं की तरफ स्थापित हैं, इसी वजह से यहां स्थित मुख्य मंदिर को ‘चौमुखा मंदिर’ या ‘चतुर्मुख मंदिर’ कहते हैं। इस मंदिर के अलावा दो अन्य मंदिर भी हैं, जहां जैन तीर्थकर नेमिनाथ और भगवान पार्श्वनाथ की प्रतिमाएं शोभायमान हैं। यहां एक वैष्णव मन्दिर सूर्यनारायण का भी स्थित है। इसके अलावा इसके करीब 1 किलोमीटर दूरी पर अम्बा माता का मंदिर भी बना हुआ है। आपको बता दें कि इस मंदिर में करीब 76 छोटे गुम्बदनुमा पवित्र स्थान, 4 बड़े पूजन स्थल और 4 बड़े प्रार्थना कक्ष बने हुए हैं। इसके साथ ही इस मंदिर की सबसे बड़ी खासियत यह है कि यहां करीब 1444 खंभों का निर्माण इस तरह किया गया है कि कहीं से भी देखने पर मुख्य धार्मिक और पवित्र स्थल के दर्शन करने में कोई दिक्कत नहीं होती है, वहीं अनोखे और अलग-अलग कलाकृतियों से निर्मित इन खंभों में अति सुंदर नक्काशी भी की गई है, जिसे देखते ही बनता है। इस मंदिर की सुरक्षा को देखते हुए यहां तहखाना का निर्माण भी किया गया है। इस भव्य मंदिर की सुंदरता को देखने के लिए और इस मंदिर के दर्शन के लिए लाखों भक्तों का यहां तांता लगा रहता है। इस आर्कषक नक्काशी वाले भव्य रणकपुर जैन मंदिर – Ranakpur Jain Mandir की मान्यता है कि इस मंदिर में प्रवेश करने से मनुष्य, जीवन-मत्यु की करीब 84 योनियों से मुक्त हो जाता है और उसे मोक्ष की प्राप्ति होती है। वहीं इस पवित्र और धार्मिक जैन स्थल में जैन धर्म के लोगों की अटूट आस्था और गहरी श्रद्धा है, इसलिए लाखों भक्त यहां दर्शन के लिए आते हैं। \n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/34.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/35.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  " Fateh Sagar Lake\n",
                  style: TextStyle(
                      fontSize: 20,
                      fontWeight: FontWeight.bold,
                      color: Color.fromRGBO(0, 0, 0, 1)),
                ),
                Text(
                  ": फतेह सागर झील उदयपुर के उत्तर-पश्चिम में स्थित एक बहुत ही शानदार झील है जो इस शहर के सबसे खास पर्यटन स्थलों में से एक है। अरावली पहाड़ियों से घिरे शहर उदयपुर में यह दूसरी सबसे बड़ी मानव निर्मित झील है। यह झील अपनी सुंदरता के लिए जानी जाती है और अपने शांत वातावरण से यहां आने वाले पर्यटकों को एक अद्भुद शांति का एहसास कराती है। यहाँ मोती मगरी रोड पर पर्यटक गाड़ी से फतेह सागर झील की परिधि में आसानी से जा सकता है और यहां से पूरी झील के आकर्षक नजारे को देख सकता है। इस खास पर्यटन स्थल में दोपहर में शांत सुंदरता का आनंद लेने के बाद आप इसके अलवा बोटिंग भी कर सकते हैं और यहां पर्यटकों के लिए उपलब्ध अन्य पानी के खेलों में भी भाग ले सकते हैं। फतेह सागर झील शहर की शहर की चार झीलों में से एक होने की वजह से यहाँ पर पर्यटकों की काफी भीड़ आती है। इस जगह पर लोग नीले पानी में बोटिंग का मजा लेने और यहाँ की प्राकृतिक सुंदरता को देखने जरुर आते हैं। फतेह सागर झील की प्राकृतिक सुंदरता और आकर्षण ने इसको एक खास पर्यटन स्थल बना दिया है। बता दें मूल रूप से फतेह सागर झील का निर्माण महाराणा जय सिंह ने वर्ष 1687 में किया था। हालांकि, लगभग 200 साल बाद 1888 में बाढ़ में नष्ट हो जाने के बाद महाराणा फतेह सिंह ने 1889 में कनॉट बांध बनाया, जिसने वर्तमान झील को आकार दिया और उन्हें सम्मानित करने के लिए इसका नाम बदलकर फतेह सागर झील रखा गया। फतेह सागर झील तीन अलग- अलग द्वीपों में विभाजित है। जिसमें से सबसे बड़ा द्वीप नेहरु पार्क कहलाता है। इस जगह पर नाव के आकार का एक रेस्टोरेंट और बच्चों के लिए एक छोटा चिड़ियाघर भी स्थित है जो एक पिकनिक स्पॉट के रूप में काफी लोकप्रिय है। इस झील के दूसरे द्वीप में एक सार्वजनिक पार्क है जिसमें वाटर-जेट फव्वारे लगे हुए हैं। तीसरे द्वीप में उदयपुर सौर वेधशाला स्थित है। TIME= गर्मियों का मौसम फतेह सागर झील की यात्रा करने के लिए अनुकूल नहीं होता क्योंकि इस मौसम में उदयपुर का तापमान  40 डिग्री सेल्सियस तक बढ़ जाता है। इसलिए मार्च से लेकर जून के बीच यहां की यात्रा करने से आपको बचना चाहिए। मानसून का मौसम जलाई से शुरू होता है और सितंबर तक रहता है। इस मौसम में आप फतेह सागर झील के शानदार नजारों का मजा ले सकते हैं। मानसून के मौसम में उदयपुर का तापमान 25 से 35 डिग्री सेल्यिस के बीच रहता है, इसलिए यह समय झील की यात्रा करने का एक आदर्श समय है। झील के पास जाने का सबसे अच्छा समय शाम का है क्योंकि इस दौरान आप यहां सूर्यास्त के लुभावने दृश्य को देख सकते हैं।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/36.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/37.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "City Palace\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "पिछोला झील के किनारे,उदयपुर में सिटी पैलेस राजस्थान में सबसे बड़ा शाही परिसर माना जाता है। इस शानदार महल का निर्माण वर्ष 1559 में महाराणा उदय सिंह (Maharana Uday Singh) ने करवाया था जहाँ महाराणा रहते थे और राज्य का संचालन करते थे। इसके बाद महल को उसके उत्तराधिकारियों द्वारा और भी शानदार बना दिया गया,जिसने इसमें कई संरचनाएँ जोड़ीं। पैलेस में अब महल, आंगन, मंडप, गलियारे, छतों, कमरे और लटकते उद्यान हैं। यहां एक संग्रहालय भी है जो राजपूत कला और संस्कृति के कुछ बेहतरीन तत्वों को प्रदर्शित करता है – जिसमें रंगीन चित्रों से लेकर राजस्थानी महलों में पाए जाने वाले विशिष्ट स्थापत्य शामिल हैं।  अरावली की गोद में बसा सिटी पैलेस का ग्रेनाइट और संगमरमर का किनारा प्राकृतिक परिवेश के विपरीत है। रीगल महल की जटिल वास्तुकला मध्ययुगीन, यूरोपीय और साथ ही चीनी प्रभावों का एक मिश्रण है और कई गुंबदों, मेहराबों और मीनारों से अलंकृत है। सिटी पैलेस खुद हरे भरे बगीचे पर बसा हुआ है और देखने के लिए काफी आकर्षक है। बता दें कि सिटी पैलेस में ‘गाइड’ ‘गोलियों की रासलीला राम-लीला’ और जेम्स बॉन्ड फिल्म ‘ऑक्टोपसी’ जैसी कई फिल्मों की शूटिंग की गई है। स्थापत्य प्रतिभा और समृद्ध विरासत का एक सौम्य संगम है उदयपुर का सिटी पैलेस। तो आज के इस आर्टिकल में हम आपको यात्रा कराते हैं झीलों के बीचों-बीच बसे सिटी पैलेस की।\n",
                  style: TextStyle(fontSize: 20),
                ),
              ],
            ),
          ),
        ),
      ),
    ]));
  }
}
