import 'package:flutter/material.dart';
import 'package:flutter/src/widgets/container.dart';
import 'package:flutter/src/widgets/framework.dart';

class jaisalmer extends StatefulWidget {
  const jaisalmer({super.key});

  @override
  State<jaisalmer> createState() => _jaisalmerState();
}

class _jaisalmerState extends State<jaisalmer> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        body: ListView(children: [
      Center(
        child: Material(
          child: Container(
            decoration: BoxDecoration(
                borderRadius: BorderRadius.circular(10),
                color: Color.fromARGB(255, 255, 252, 252)),
            padding: EdgeInsets.all(15),
            width: MediaQuery.of(context).size.width * 8,
            // height: 900,
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                ClipRRect(
                  borderRadius: BorderRadius.circular(5),
                  child: Image.asset(
                    "Assets/image/51.webp",
                    fit: BoxFit.fill,
                    height: 170,
                    width: double.maxFinite,
                  ),
                ),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Jaisalmer Fort  \n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "राजस्थान में मौजूद कई खूबसूरत ऐतिहासिक इमारतें और किले केवल देश के लोगों में ही नहीं विदेश पर्यटकों में भी काफी मशहूर हैं। यहां के हर एक जिले में आपको एक से एक ऐतिहासिक फोर्ट देखने को मिल जाएंगे, जो काफी गर्व के साथ खड़े हुए हैं।, राजस्थान में मौजूद कई खूबसूरत ऐतिहासिक इमारतें और किले केवल देश के लोगों में ही नहीं विदेश पर्यटकों में भी काफी मशहूर हैं। यहां के हर एक जिले में आपको एक से एक ऐतिहासिक फोर्ट देखने को मिल जाएंगे, जो काफी गर्व के साथ खड़े हुए हैं। इन किलों को देखने के लिए हर साल देसी पर्यटकों के साथ-साथ विदेशी पर्यटकों की भी अच्छी खासी भीड़ देखने को मिलती है। अब हम किलों के बारे में बात कर ही रहे हैं, तो आपको बता दें राजस्थान के जैसलमेर शहर में एक ऐसा ही फोर्ट है, जो हर देखे जाने वाले सैलानियों को सरप्राइज कर देता है। हम बात कर रहे हैं त्रिकुटा हिल पर बने जैसलमेर फोर्ट की, जो भारत के इतिहास के साथ-साथ अपनी बेहतरीन संरचना के लिए दुनियाभर में प्रसिद्ध है। चलिए आपको इस लेख में इससे जुड़े कुछ तथ्यों के बारे में बताते हैं। जैसलमेर किले का निर्माण वर्ष 1156 में भाटी राजपूत राजा रावल जैसल द्वारा किया गया था। 1294 के आसपास, भाटी साम्राज्य को अलाउद्दीन खिलजी (खलीजी वंश के शासक) द्वारा 8 से 9 साल की घेराबंदी का सामना करना पड़ा। 1551 के आसपास रावल लूनाकरण के शासन के दौरान, किले पर फिर से अमीर अली (एक प्रसिद्ध अफगान प्रमुख) द्वारा हमला किया गया था। जिसके बाद राजा को अपनी बेटी की शादी हुमायूं के बेटे अकबर से करनी पड़ी। इसके बाद किले पर आक्रमण होने से बच गया ओर किले को सुरक्षित बचा लिया गया। जैसलमेर का भव्य किला यूनेस्को की विश्व धरोहर स्थल है। पूरा किला पीले बलुआ पत्थर से बना हुआ है और देखने में बेहद खूबसूरत लगता है। लोग विशेष रूप से यहां सूर्यास्त देखने आते हैं। सूर्य की किरणें पूरे किले की शोभा में चार चांद लगा देती हैं। किले की पीली दीवारें, सूरज की किरणों से मानों नहा सी जाती हैं, इस खूबसूरती को देखते हुए भी इस किले का नाम सोनार किला या स्वर्ण किला पड़ा था।किले में कुछ हवेलियां भी हैं, जिनमें पटवाओं की हवेली, नथमल की हवेली, सलाम सिंह की हवेली शामिल हैं। कहा जाता है कि भारत में आपको बहुत ही कम फोर्ट मिलेंगे जहां आपको एक साथ राजपुताना और इस्लामी शैली एक साथ दिख जाए। लेकिन अगर आपको सच में इस तरह की वास्तुकला देखनी है, तो आपको एक बार जैसलमेर फोर्ट जरूर आना चाहिए।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/52.webp",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/53.webp",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Sonar Fort\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "जैसलमेर राजस्थान का सबसे ख़ूबसूरत शहर है और जैसलमेर पर्यटन का सबसे आकर्षक स्थल माना जाता है। जैसलमेर का गौरवशाली दुर्ग त्रिभुजाकार पहाड़ी पर स्थित हैं। इसकी सुरक्षा के लिए इसके चारों ओर परकोटे पर तीस-तीस फीट ऊँची 99 बुर्जियाँ बनी हैं। चूँकि यह क़िला और इसमें स्थित सैंकड़ों अवासीय भवन पीले पत्थरों से बने हुए हैं और सूर्य की रोशनी में स्वर्णिम आभा बिखेरते हैं इसलिए इसे सोनार क़िला के नाम से पुकारा जाता है। अन्य वैष्णव मंदिरों के अलावा दुर्ग में स्थापत्य एवं शिल्प कला के सजीव केन्द्र के रूप में जैन मंदिर बने हुए हैं। 'जिन भद्र सूरि ज्ञान भण्डार' दुर्ग स्थित जैन मंदिरों के तहखानों में बना हुआ है। जिन भद्रसूरि ज्ञान भण्डार प्राचीन ताड पत्रों व काग़ज़ी पुस्तकों एवं ग्रंथों के संग्रह के लिए प्रसिद्ध हैं। इसमें कई प्राचीन ग्रंथों का भण्डार हैं, जो संस्कृत, मागधी, पालि, गुजराती भाषा, मालवी भाषा, डिंगल भाषा व अन्य कई भाषाओं में अनेकों विषयों पर लिखे गये हैं।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/54.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/55.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Roothi Rani Ka Mahal \n",
                  style: TextStyle(
                      color: Colors.black,
                      fontSize: 20,
                      fontWeight: FontWeight.bold),
                ),
                Text(
                  "जोधपुर। राजस्थान के राजवंशों के गौरवशाली इतिहास के साथ इनके किस्से भी बड़े रोचक हैं। बात राजा मालदेव की शादी के समय की है। रानी उमादेसुहाग की सेज पर राजा का इंतजार करती रही और वो पहुंचे ही नहीं। रानी ने राजा को बुला लाने के लिए दासी को भेजा। राजा ने दासी को रानी समझ उसे अपने पास बैठा लिया, ये देख रानी गुस्सा हो गई और राजा से जिंदगी भर बात नहीं की। जब राजा रानी को मनाने पहुंचे तो उमादे ने कहा कि अब आप मेरे लायक नहीं रहे। जानें क्या है पूरी कहानी... Dainikbhaskar.com जानों राजस्थान सीरीज के तहत यहां के राज परिवारों की कही अनकही कहानियां बता रहा है। इसी कड़ी में आज पढ़िए मारवाड़ के राजा राव मालदेव की एक रानी की कहानी... एक गलती पड़ी भारी पांच सदी पूर्व मारवाड़ में राजा राव मालदेव थे।इनकी एक गलती के कारण उनका नई रानी उनसे रूठ गई थीं। रानी ने भी ऐसा प्रण लिया कि जीवनभर अपनी बात पर कायम रही और इतिहास में रूठीं रानी के नाम से प्रसिद्ध हो गई। जीवनभर अपने पति से नहीं बोलने वाली रूठी रानी ने मरने के बाद अपने पति का साथ दिया और उसके साथ ही सती हो गई। कुछ ऐसी है पूरी कहानी - पूरे राजपूताना में आज तक राव मालदेव की टक्कर का अन्य कोई राजपूत शासक नहीं हुआ। जीवन में 52 युद्ध लड़ने वाले इस शूरवीर की शादी 24 वर्ष की आयु में वर्ष 1535 में जैसलमेर की राजकुमारी उमादे के साथ हुआ। - उमादे अपनी सुंदरता व चतुरता के लिए प्रसिद्ध थी। राठौड़ राव मालदेव की बरात शाही लवाजमे के साथ जैसलमेर पहुंची। राजकुमारी उमादे राव मालदेव जैसा शूरवीर और महाप्रतापी राजा को पति के रूप में पाकर बहुत खुश थी। - शादी होने के बाद राव मालदेव अपने सरदारों व संबंधियों के साथ महफिल में बैठ गए और रानी उमादे सुहाग की सेज पर उनकी राह देखती-देखती थक गई। - इस पर रानी ने दहेज में मिली अपनी खास दासी भारमली को राजा को बुलाने भेजा। दासी भारमली राव मालदेव को बुलाने गई। खूबसूरत दासी को नशे में चूर राव ने रानी समझ कर अपने पास बैठा लिया। - काफी वक्त गुजरने के बाद भी भारमली के न आने पर रानी जब राव के कक्ष में गई तो वहां भारमली को उनके आगोश में देखा। इससे नाराज हो उमादे ने राव के स्वागत के लिए तैयार किया आरती का थाल वहीं यह कह उलट दिया कि अब राव मेरे लायक नहीं रहे। - सुबह राव मालदेव नशा उतरा तब वे बहुत शर्मिंदा हुए और रानी के पास गए, लेकिन तब तक वह रानी उमादे रूठ चुकी थी। कभी नहीं मिली राजा से, लेकिन उनके साथ हो गई सती - ये रानी आजीवन राव मालदेव से रूठीं ही रही और इतिहास में रूठीं रानी के नाम से मशहूर हुई। इस रानी के लिए किले की तलहटी में एक अलग महल भी बनवाया गया, लेकिन वह वहां भी कुछ दिन रह कर वापस लौट गई। - जब शेरशाह सूरी ने मारवाड़ पर आक्रमण किया तो रानी से बहुत प्रेम करने वाले राव मालदेव ने युद्ध में प्रस्थान करने से पूर्व एक बार उनसे मिलने का अनुरोध किया। एक बार मिलने को तैयार होने के बाद रानी उमादे ने ऐन वक्त पर मिलने से इनकार कर दिया। - इतिहासकार यह भी मानते है कि रूठी रानी के मिलने से इनकार करने का राव मालदेव पर बहुत बुरा प्रभाव पड़ा और वह अपने जीवन में पहली बार कोई युद्ध हार गया। - वर्ष 1562 में राव मालदेव के निधन का समाचार मिलने पर रानी उमादे को अपनी भूल का अहसास हुआ और उन्हें बहुत कष्ट पहुंचा। राव मालदेव से बहुत प्रेम करने वाली रानी उमादे प्रायश्चित के रूप में उनकी पगड़ी के साथ स्वयं को अग्नि को सौंप सती हो गई।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/56.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/57.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Pokhran Fort \n",
                  style: TextStyle(
                      fontSize: 20,
                      fontWeight: FontWeight.bold,
                      color: Color.fromRGBO(0, 0, 0, 1)),
                ),
                Text(
                  "पोखरण भारतीय राज्य राजस्थान के जैसलमेर जिले में स्थित एक शहर और एक नगर पालिका है। यह थार रेगिस्तान क्षेत्र में एक दूरस्थ स्थान है और भारत के पहले भूमिगत परमाणु हथियार विस्फोट के लिए परीक्षण स्थल के रूप में कार्य करता है। बालागढ़ किला 14 वीं शताब्दी में मारवाड़ ठाकुर, राव मालदेव द्वारा बनाया गया था, इसे अन्यथा पोखरण किले के रूप में जाना जाता है। पोखरण का अर्थ रेतीली, पथरीली, लवणीय श्रेणियों से घिरी पांच मृगतृष्णाओं का स्थान है। हालांकि लाल बलुआ पत्थर से बना एक छोटा मंदिर, किला देवी दुर्गा को समर्पित है। यह थार रेगिस्तान के एक दूरस्थ क्षेत्र में स्थित है, जिसने भारत के पहले भूमिगत परमाणु हथियार विस्फोटों के लिए एक परीक्षण स्थल के रूप में भी काम किया। राजसी किले में हाथी भगदड़ को रोकने के लिए भयावह स्पाइक्स के साथ एक विशाल दरवाजा है। इसमें शस्त्रागार, मिट्टी के बर्तनों, लघु चित्रों और बीते युग के महाराजाओं द्वारा पहने जाने वाले परिधानों को प्रदर्शित करने वाला एक संग्रहालय है। किले के चारों ओर पोखरण गांव है जो हर यात्री का गर्मजोशी से स्वागत करता है। बाजार में काम करने वाले स्थानीय बुनकर और कुम्हार, रेत के टीलों पर सफारी, प्रवासी पक्षियों को खाना खिलाने वाला समुदाय, ये सभी पोखरण की सुंदरता हैं। जैसलमेर में पोखरण किले की यात्रा करने का सबसे अच्छा समय सर्दियों के मौसम के दौरान होता है जो नवंबर के महीने में शुरू होता है और फरवरी तक रहता है। शेष वर्ष, जैसलमेर में अत्यधिक उच्च तापमान का अनुभव होता है, जिससे रेगिस्तान शुष्क और शुष्क रहता है। सर्दियों के मौसम में पारा का स्तर अधिकतम 31 डिग्री सेल्सियस और न्यूनतम 7 डिग्री सेल्सियस के बीच उतार-चढ़ाव करता है। औसत लगभग 20 डिग्री सेल्सियस रहता है, जिससे थार रेगिस्तान के बीच में स्थित किले का पता लगाने का यह एक सुखद समय है। ग्रीष्मकाल और मानसून (अप्रैल से सितंबर तक) की सिफारिश नहीं की जाती है क्योंकि औसत तापमान काफी अधिक होता है, गर्मियों के दौरान लगभग 34 डिग्री सेल्सियस और मानसून के दौरान 30 डिग्री सेल्सियस, और इस क्षेत्र में कम मात्रा में वर्षा होती है।\n",
                  style: TextStyle(fontSize: 20),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("Assets/image/58.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 8,
                ),
                Image.asset("Assets/image/59.jpg",
                    fit: BoxFit.fill, height: 170, width: double.maxFinite),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "Tanot Mata Temple\n",
                  style: TextStyle(
                      color: Colors.black,
                      fontWeight: FontWeight.bold,
                      fontSize: 20),
                ),
                Text(
                  "  बहुत ही रोचक है और मैं आपको विश्वास के साथ कह सकता हूँ कि मैं आपको इस आर्टिकल में तनोट माता मंदिर का जो इतिहास बताऊँगा उसको पढ़कर आपको मजा आ जाएगा। इसके लिए आप हमारे इस आर्टिकल को पूरा जरूर पढ़िए तो चलिए शुरू करते है। प्राचीन काल में बहुत पहले मामड़िया नाम के एक चारण थे ओर उनकी कोई संतान नही थी और संतान प्राप्ति की लालसा लेकर उन्होंने सात बार हिंगलाज शक्तिपीठ की पैदल यात्रा की। तब एक बार हिंगलाज माता उनके सपने में आयी और पूछी कि तुम्हारी क्या इच्छा है तो मामड़िया ने कहा कि माता आप एक बार मेरे घर पर जन्म लें। माता ने उनको इच्छा पूर्ति का आशीर्वाद दे दिया ओर अंतर्ध्यान गयी। बाद में माता की कृपा से चारण के घर 7 पुत्रियों और 1 पुत्र ने जन्म लिया। उन सभी पुत्र-पुत्रियों में से आवड़ माता प्रथम संतान थी जिन्होंने विक्रम संवत 808 में मामड़िया चारण के घर पर जन्म लिया। बाल्यकाल से ही आवड़ माता ने अपना चमत्कार दिखाना शूरु कर दिया। चारण के घर जन्मी सातों पुत्रियां देवी स्वरूप थी और शक्ति का प्रतीक थी। उन्होंने हूणों के आक्रमण से माड़ प्रदेश की रक्षा भी की थी।   तनोट माता मंदिर के बारे में बहुत से लोग जानते होंगे, जो व्यक्ति ट्रेवल करते है या फिर जिन्हें एक जगह से दूसरी जगह घूमना पसंद है उन्हें तनोट माता के मंदिर के बारे में पता होगा लेकिन बहुत से ऐसे लोग भी है जिन्हें इस मंदिर के बारे में पता नही होगा। उनके लिए इस मंदिर का इतिहास जानना बहुत ही रोचक होगा तो आज में आपको आर्टिकल में तनोट माता मंदिर के बारे में सब कुछ बताऊँगामै आपको इस मंदिर में बारे में वह सब कुछ बताऊँगा जो की बहुत कम लोग जानते होंगे और मेरा यह आर्टिकल पढ़ने के बाद आप भी यहाँ आने के लिए उत्सुक्त हो जाओगे। हम सभी जानते है कि भारत में बहुत से मंदिर है इसलिए इसको मंदिरों का स्थान भी कहा जाता है। यहाँ के लोगों में जो मंदिरों और ईश्वर में श्रद्धा है वह देखने लायक है। भारत में बहुत ही चमत्कारी मंदिर है जिनमें लोगों का बहुत विश्वास है। आज हम आपको ऐसे ही शक्तिशाली मंदिर के बारे में बताने जा रहे जिसका नाम तनोट माता मंदिर है। तो चलिये हम देख लेते है कि इस मंदिर का इतिहास क्या है और क्यों इस मंदिर को अधिक संख्या में लोग दूर-दूर से देखने आते है? तो चलिये शुरू करते है ।  तनोट माता मंदिर राजस्थान राज्य में स्थित है। यह मंदिर जैसलमेर से लगभग 130 किलोमीटर की दूरी पर भारत-पाकिस्तान की बॉर्डर सीमा के निकट स्थित है। यह करीब 1200 साल प्राचीन मंदिर है। जैसा कि मैंने आपको इस लेख की शुरुआत में भी बताया था कि भारत में बहुत से मंदिर है और सभी मंदिर अपने चमत्कारों के लिए प्रसिद्ध है। इसी प्रकार तनोट माता मंदिर में भी हमेशा से ही लोगों की आस्था व विश्वास रहा है। लेकिन इस मंदिर ने अपना चमत्कार सन 1965 में दिखाया। उस समय भारत-पाकिस्तान का युद्ध चल रहा था और उसी समय अपने कार्यों की वजह से यह मंदिर देश-विदेश में अपने चमत्कारों के लिए प्रसिद्ध हो गया। जब सन 1965 के सितंबर महीने में भारत-पाकिस्तान युद्ध प्रारम्भ हुआ तो पाकिस्तानी सेना ने पूरब में किशनगढ़ से 74 किलोमीटर दूर बुइली पर अपना कब्जा कर लिया था और पश्चिम में साधेवाला से शाहगढ़ तक अपना अधिकार कर लिया था। और उत्तर में अछरी टीबा से 6 किलोमीटर दूर तक अपना के क्षेत्र पर अपना कब्जा कर लिया था तनोट माता मंदिर तीन दिशाओं से घिर चुका था। अब स्थिति ऐसी हो चुकी थी कि यदि पाकिस्तानी सेना इस मंदिर पर कब्जा कर ले तो वह रामगढ़ से लेकर शाहगढ़ तक के इलाके पर अपना अधिकार स्थापित कर सकता था। अब तनोट माता मंदिर पर अधिकार स्थापित करना भारत ओर पाकिस्तान दोनों के लिए महत्वपूर्ण हो गया था।\n",
                  style: TextStyle(fontSize: 20),
                ),
              ],
            ),
          ),
        ),
      ),
    ]));
  }
}
